Revit 2024 API
Marble.TextureRealWorldOffsetZ Property
 The property labeled "Offset Z" from the "Marble" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string TextureRealWorldOffsetZ { get; }
Visual Basic
Public Shared ReadOnly Property TextureRealWorldOffsetZ As String
	Get
Visual C++
public:
static property String^ TextureRealWorldOffsetZ {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDistance".
See Also
Marble Class
Autodesk.Revit.DB.Visual Namespace